---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsPath
source: html/ed5913d6-1219-9c7c-7e52-317dd58d7cd3.htm
---
# Autodesk.Revit.DB.Architecture.StairsPath

An object that represents the stairs path.

## Syntax (C#)
```csharp
public class StairsPath : Element
```